## First we import packages \ modules

In [24]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

from sklearn import tree
from sklearn import preprocessing
from sklearn.ensemble import RandomForestClassifier

##  We import Dataset for Analysis

In [25]:
dataset = pd.read_csv('train.csv')
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Target Variable in Dataset is Survived, which is Binary Categorical

In [26]:
dataset.shape

(889, 12)

In [27]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 889 entries, 0 to 888
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  889 non-null    int64
 1   Survived     889 non-null    int64
 2   Pclass       889 non-null    int64
 3   Name         889 non-null    object
 4   Sex          889 non-null    object
 5   Age          889 non-null    float64
 6   SibSp        889 non-null    int64
 7   Parch        889 non-null    int64
 8   Ticket       889 non-null    object
 9   Fare         889 non-null    float64
 10  Cabin        202 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.5+ KB

In [28]:
dataset.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         0
dtype: int64

##  Of the 889 records in Dataset there are 687 missing records in Column "CABIN", making it irrlevant. We DROP this Column

In [29]:
dataset1=dataset.drop(["Cabin"],axis=1)
dataset1.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,S

In [30]:
dataset1.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64

##  Droping Irrelevent columns

Since Survival is not based on --  Name of Pasenger \ Passenger ID \ Ticket Number -- We Drop these columns

In [31]:
dataset1.drop(['PassengerId','Name','Ticket'], axis=1, inplace=True)

In [32]:
dataset1.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

##  Some columns are object variables --  converting these to Binary Categorical

In [33]:
from sklearn.preprocessing import LabelEncoder
lab = LabelEncoder()

dataset1["Sex"] = lab.fit_transform(dataset1["Sex"])
dataset1["Embarked"] = lab.fit_transform(dataset1["Embarked"])

In [34]:
dataset1.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0         0       3    1  22.0      1      0   7.2500         2
1         1       1    0  38.0      1      0  71.2833         0
2         1       3    0  26.0      0      0   7.9250         2
3         1       1    0  35.0      1      0  53.1000         2
4         0       3    1  35.0      0      0   8.0500         2

## Splitting the data

In [35]:
y = dataset1.iloc[:,:1]
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

In [36]:
X = dataset1.drop(["Survived"],axis=1)
X.head()

   Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0       3    1  22.0      1      0   7.2500         2
1       1    0  38.0      1      0  71.2833         0
2       3    0  26.0      0      0   7.9250         2
3       1    0  35.0      1      0  53.1000         2
4       3    1  35.0      0      0   8.0500         2

## Training the model using Decision Tree

In [37]:
model = tree.DecisionTreeClassifier(max_depth=14)

In [38]:
model.fit(X,y)

DecisionTreeClassifier(max_depth=14)

##  Now we Predict Score

In [39]:
model.score(X,y)

0.96962879640045

##  Now we Apply Random Forest

In [41]:
rf = RandomForestClassifier(n_estimators=1000, max_features=2, oob_score=True)
rf.fit(X,y)

<ipython-input-41-3f7564a02a70>:2: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples,), for example using ravel().
  rf.fit(X,y)

RandomForestClassifier(max_features=2, n_estimators=1000, oob_score=True)

##  Now we check OBB Score

In [42]:
rf.oob_score_

0.8008998875140607

##  Now we Find Most Relevent Column for predicting Passenger Survived or not

In [43]:
a = ['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare','Embarked']
for feature,imp in zip(a, rf.feature_importances_):
    print(feature,"\t :",imp);

Pclass 	 : 0.08424539872353717
Sex 	 : 0.26221060704073684
Age 	 : 0.25677796831630223
SibSp 	 : 0.050378305658298254
Parch 	 : 0.04058587107004932
Fare 	 : 0.27058523345842167
Embarked 	 : 0.03521661573265441

##  Inference:--

Pclass, Sex , Age, Fare have value more than 0.05 i.e., These are Important features and greatly affect the prediction of Survived Passenger

##  We Split Dataset according to Important Columns

In [53]:
x = dataset1[['Age', 'Sex', 'Fare']]
x.head()

    Age  Sex     Fare
0  22.0    1   7.2500
1  38.0    0  71.2833
2  26.0    0   7.9250
3  35.0    0  53.1000
4  35.0    1   8.0500

In [54]:
y.head()

   Survived
0         0
1         1
2         1
3         1
4         0

##  Fitting Decision Tree

In [55]:
model = tree.DecisionTreeClassifier(max_depth=8)
model.fit(x,y)

DecisionTreeClassifier(max_depth=8)

In [56]:
from sklearn import tree
predictors=x
tree_model=tree.DecisionTreeClassifier(max_depth=8)
tree_model.fit(X=predictors,y=y)

DecisionTreeClassifier(max_depth=8)

In [57]:
with open('Dtree_titanic.dot','w')as f:
    f=tree.export_graphviz(tree_model,feature_names=['Sex','Age','Fare'],out_file=f);

## Note

There are many more leaf nodes in the obtained decision tree and only few such references are mentioned below.

Leaf node inferences :--

1) 1 female passenger with fare greater than 48.2 Dollars and age less than 8 years did'nt survived.

2) 8 male passengers with age less than 6.5 years and fare less than 20.82 dollars survived.

3) 4 male passengers with age greater than 6.5 years and fare less than 26.46 dollars survived.

4) 2 male passengers with age greater than 6.5 years and fare greater than 387.66 dollars survived.

5) 4 female passengers with fare less than 28.85 dollars did'nt survived.

6) 2 male passengers with age less than 6.5 years and fare greater than 64.37 dollars survived.

7) 2 female passengers with fare greater than 44.24 dollars did'nt survived.

8) 22 female passengers with fare less than 69.42 dollars and age greater than 8 years survived.

9) 3 female passengers with fare greater than 69.42 dollars and age greater than 8 years didn't survived.

10) 45 female passengers with fare less than 70.27 dollars and age greater than 25.5 years survived.

11) 3 male passengers with age greater than 3.5 years and fare less than than 64.37 dollars didn't survived.

12) 2 male passengers with age greater than 6.5 years but less than 13.5 years and fare less than than 17.34 dollars survived.